{"last_modified": null, "etag": null, "post_dict": {"r/todayilearned": [{"title": "TIL of castaway huts (or depots) which are deliberately placed on isolated islands by governments. They contain supplies and tools which can help people who become stranded there. Most were built by the New Zealand government in the 19th and 20th centuries.", "updated": "2023/03/09 00:40:16", "link": "https://www.reddit.com/r/todayilearned/comments/11mdmt7/til_of_castaway_huts_or_depots_which_are/"}, {"title": "TIL that the actor who played Darth Vader, David Prowse, was banned from attending official Star Wars events because he leaked too many plot details.", "updated": "2023/03/09 02:28:36", "link": "https://www.reddit.com/r/todayilearned/comments/11mg36r/til_that_the_actor_who_played_darth_vader_david/"}, {"title": "TIL the Myers-Briggs has no scientific basis whatsoever.", "updated": "2023/03/08 18:54:03", "link": "https://www.reddit.com/r/todayilearned/comments/11m4msi/til_the_myersbriggs_has_no_scientific_basis/"}, {"title": "TIL the Girl Scouts sell 200 million boxes each year, surpassing sales of Oreos, not to mention sales of all Chips Ahoy and Milano cookies combined", "updated": "2023/03/09 01:37:55", "link": "https://www.reddit.com/r/todayilearned/comments/11meyxv/til_the_girl_scouts_sell_200_million_boxes_each/"}, {"title": "TIL there is an official IRS guide for: What to Do When the Taxpayer Threatens Suicide", "updated": "2023/03/09 03:12:04", "link": "https://www.reddit.com/r/todayilearned/comments/11mh1qw/til_there_is_an_official_irs_guide_for_what_to_do/"}, {"title": "TIL that in Canada’s province of Nunavut, 30% of the population has attempted suicide, compared to 3% for the rest of Canada", "updated": "2023/03/09 05:54:37", "link": "https://www.reddit.com/r/todayilearned/comments/11mkb3o/til_that_in_canadas_province_of_nunavut_30_of_the/"}, {"title": "TIL The prototype of the Rolls Royce Ghost was so quiet inside that it made test drivers sick. The engineers had to remove some of the noise-isolating material, and create seats that vibrated at specific frequencies to introduce some noise into the interior.", "updated": "2023/03/08 19:37:50", "link": "https://www.reddit.com/r/todayilearned/comments/11m5tai/til_the_prototype_of_the_rolls_royce_ghost_was_so/"}, {"title": "TIL that the second fastest manmade object was a 2,000 lb steel plate cap covering a borehole for a nuclear blast. It's estimated that it reached speeds above 150,000 mph, almost 200 times the speed of sound. It most likely vaporized due to friction with the atmosphere before it could reach space.", "updated": "2023/03/09 03:44:53", "link": "https://www.reddit.com/r/todayilearned/comments/11mhqwo/til_that_the_second_fastest_manmade_object_was_a/"}, {"title": "TIL Dr. Sigmund Freud was addicted to smoking and failed to quit for good throughout a 45 years long battle that included 33 operations for cancer of the jaw, an artificial jaw replacement, and attacks of \"tobacco angina\" exacerbated by nicotine . He was known to smoke up to twenty cigars a day.", "updated": "2023/03/08 16:56:38", "link": "https://www.reddit.com/r/todayilearned/comments/11m1iyy/til_dr_sigmund_freud_was_addicted_to_smoking_and/"}, {"title": "TIL that Nikola Tesla once worked for Thomas Edison but left due to a disagreement over payment for his work on improving Edison's DC power systems. Tesla went on to develop AC power systems, which became the basis for modern electrical grids.", "updated": "2023/03/09 12:06:59", "link": "https://www.reddit.com/r/todayilearned/comments/11mqiud/til_that_nikola_tesla_once_worked_for_thomas/"}, {"title": "TIL of Larry Bader, Ohio salesman who went missing out on Lake Erie during a storm in 1957. 5 years later, he was found in Nebraska by relatives during an archery demonstration, with absolutely no recollection as to who he actually was.", "updated": "2023/03/09 06:56:10", "link": "https://www.reddit.com/r/todayilearned/comments/11mlex6/til_of_larry_bader_ohio_salesman_who_went_missing/"}, {"title": "TIL that Margaret Ann Neve was the first recorded female supercentenarian and the second validated human to reach the age of 110. She was also the first proven individual whose life spanned three centuries, having been born in 1792 and died in 1903.", "updated": "2023/03/09 04:51:29", "link": "https://www.reddit.com/r/todayilearned/comments/11mj3uq/til_that_margaret_ann_neve_was_the_first_recorded/"}, {"title": "TIL that the Fahrenheit scale was standardized 18 years before Celsius. The world switch due to the British Empire. The United States is actually using the earlier standard.", "updated": "2023/03/08 13:26:46", "link": "https://www.reddit.com/r/todayilearned/comments/11lwdqa/til_that_the_fahrenheit_scale_was_standardized_18/"}, {"title": "TIL During the 50's and 60's, Dr. Chester M. Southam injected patients and prisoners with cancer cells (HeLa cells) for research without their consent. He was reported and suspended for a year despite a cover up attempt. He later became President of the American Association for Cancer Research.", "updated": "2023/03/08 22:34:04", "link": "https://www.reddit.com/r/todayilearned/comments/11mag4v/til_during_the_50s_and_60s_dr_chester_m_southam/"}, {"title": "TIL about a man named Herostratus who burned down the second Temple of Artemis at Epheseus in 356 BC to become famous. He was tortured and executed for it, and authorities in the region made mentioning his name punishable by death.", "updated": "2023/03/09 04:54:38", "link": "https://www.reddit.com/r/todayilearned/comments/11mj61h/til_about_a_man_named_herostratus_who_burned_down/"}, {"title": "TIL In 1815, Jefferson sold his 6,700-volume personal library to Congress for $23,950 to replace books lost when the British burned the U.S. Capitol, which housed the Library of Congress, during the War of 1812. Jefferson's books formed the foundation of the rebuilt Library of Congress's collections", "updated": "2023/03/09 08:19:37", "link": "https://www.reddit.com/r/todayilearned/comments/11mmtoa/til_in_1815_jefferson_sold_his_6700volume/"}, {"title": "TIL Former Vice President Walter Mondale was cremated and is the only past President or Vice President not to have a gravesite.", "updated": "2023/03/09 01:41:39", "link": "https://www.reddit.com/r/todayilearned/comments/11mf1yv/til_former_vice_president_walter_mondale_was/"}, {"title": "TIL that Ferdie Pacheco was both Muhammad Ali’s doctor and his cornerman. In 1977, Pacheco noted that Ali got poor results in a series of physical reflex tests and advised him to retire from boxing. When Ali ignored this, Pacheco quit Ali’s team, no longer feeling confident with Ali’s condition.", "updated": "2023/03/09 01:11:56", "link": "https://www.reddit.com/r/todayilearned/comments/11medte/til_that_ferdie_pacheco_was_both_muhammad_alis/"}, {"title": "TIL emergency oxygen masks on airplanes only last for ~10-14min.", "updated": "2023/03/08 19:06:06", "link": "https://www.reddit.com/r/todayilearned/comments/11m4yni/til_emergency_oxygen_masks_on_airplanes_only_last/"}, {"title": "TIL Roughly 95% of Scottish single malt whisky is made in former bourbon barrels. American laws require bourbon barrels only be used once so they are cheap and plentiful for reuse elsewhere. The barrels often add vanilla, caramel, or nutty aromas.", "updated": "2023/03/08 11:40:22", "link": "https://www.reddit.com/r/todayilearned/comments/11lu5tt/til_roughly_95_of_scottish_single_malt_whisky_is/"}, {"title": "TIL that in 1958 an atomic bomb that fell on a farm in South Carolina and didn't detonate, leaving a massive crater sized at 24 feet deep and 50 feet wide.", "updated": "2023/03/09 02:52:31", "link": "https://www.reddit.com/r/todayilearned/comments/11mgm8d/til_that_in_1958_an_atomic_bomb_that_fell_on_a/"}, {"title": "TIL there are 21,215 7-Eleven stores in Japan (nearly 30% of global stores), with 2,824 stores in Tokyo alone", "updated": "2023/03/09 08:22:21", "link": "https://www.reddit.com/r/todayilearned/comments/11mmvae/til_there_are_21215_7eleven_stores_in_japan/"}, {"title": "TIL Alex Trebek nearly became a priest. In college, Trebek considered becoming a priest and went so far as to spend a summer at a Trappist monastery. But it was the vow of silence that changed his mind. He later said, “I’m not one to keep my big mouth shut.”", "updated": "2023/03/09 04:46:58", "link": "https://www.reddit.com/r/todayilearned/comments/11mj0iu/til_alex_trebek_nearly_became_a_priest_in_college/"}, {"title": "TIL Bruce Willis put out two albums back in the 80’s. One of his most played tracks is a cover of Under the Boardwalk.", "updated": "2023/03/09 06:24:58", "link": "https://www.reddit.com/r/todayilearned/comments/11mkv5x/til_bruce_willis_put_out_two_albums_back_in_the/"}, {"title": "TIL that the American Cancer Society majorly updated guidelines for cervical cancer screenings. Old guidance: pap smear every 3 years for women 21-65. New guidance: HPV test every 5 years for women 25-65.", "updated": "2023/03/09 03:31:50", "link": "https://www.reddit.com/r/todayilearned/comments/11mhh4h/til_that_the_american_cancer_society_majorly/"}]}}